In [31]:
import pandas as pd
df = pd.read_csv("miniProject.csv")
print(df.head(3))

   Order ID Customer Name     Category Sub-Category  Quantity  Price  \
0      2001       Charlie        Books      Fiction         3    500
1      2002       Charlie     Clothing        Shirt         3   1200
2      2003           Bob  Electronics      Fiction         2    500

   Order Date Region  Total
0  2024-12-01  North   1500
1  2024-11-02  South   3600
2  2024-01-03  South   1000

In [ ]:
print(f"rows = {df.shape[0]}\ncolumn = {df.shape[1]}")
print(f"Datatypes - {df.dtypes}")

In [ ]:
df1 = df.groupby("Customer Name")["Total"].sum().sort_values(ascending=False).head(3).reset_index()
df1

In [ ]:
ans = df.groupby("Customer Name")['Total'].mean().reset_index()
ans

In [ ]:
df['Order Date'] = pd.to_datetime(df["Order Date"])
df['Months'] = df['Order Date'].dt.month_name()
df['Months']

In [ ]:
ans = df.groupby('Months')["Total"].sum().sort_values().reset_index()
ans

In [32]:
df.groupby('Category')['Price'].agg(['count', 'min', 'max', 'mean'])

             count  min   max   mean
Category
Books            4  300  1200  625.0
Clothing         2  700  1200  950.0
Electronics      4  300  1200  800.0

In [30]:
ans = df[df['Total'] > 1200].sort_values('Total', ascending=False)
ans

,Order ID,Customer Name,Category,Sub-Category,Quantity,Price,Order Date,Region,Total,Months
1,2002,Charlie,Clothing,Shirt,3,1200,2024-11-02,South,3600,November
9,2010,Diana,Books,Mobile,3,1200,2024-12-10,North,3600,December
6,2007,Evan,Electronics,Mobile,2,1200,2024-04-07,South,2400,April
0,2001,Charlie,Books,Fiction,3,500,2024-12-01,North,1500,December
4,2005,Bob,Books,Shirt,3,500,2024-11-05,West,1500,November
5,2006,Diana,Clothing,Fiction,2,700,2024-12-06,West,1400,December